Revit 2024 API
BuiltInFailures.RoofFailures.OnlyOneSlopeCurtainRoof Property
 Only one slope in curtain roof.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId OnlyOneSlopeCurtainRoof { get; }
Visual Basic
Public Shared ReadOnly Property OnlyOneSlopeCurtainRoof As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ OnlyOneSlopeCurtainRoof {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RoofFailures Class
Autodesk.Revit.DB Namespace